// Вычислить значение формиулы (a*b)/(c+d),
// где a,b,c,d - некоторые числа.
// Результат вывести на экран.

int a = 5;
int b = 4;
int c = 4;
int d = 1;

double rez = (a * b) / (c + d);

Console.Write(rez);